#### BuiltInFailures.ConversionFailures Members

---

|  |
| --- |
| BuiltInFailures ConversionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ConversionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotConvertPercentToDouble | Cannot convert concentration percent ' [Percentage Value] ' to double value |
| Public property Static member | CannotConvertTempToDouble | Cannot convert temperature '[Temperate Value]' to double value |
| Public property Static member | CannotConvertToDouble | Cannot convert '[Text] ' to double value |
| Public property Static member | UndefinedFluidUnit | Undefined fluid unit: '[Fluid Unit Type Name]' |
| Public property Static member | UndefinedTemperatureUnit | Undefined temperature unit: '[Temperature Unit Type Name]' |

# See Also

BuiltInFailures ConversionFailures Class

Autodesk.Revit.DB Namespace